package com.example.tourism.model

import com.example.tourism.R

object AttractionItems {
    val heidarAbadCastle = Attraction(
        name = "قلعه حیدر آباد",
        description = "قلعه «حیدرآباد» در جنوب شرق خاش از جمله آثار تاریخی مهم شهرستان خاش به شمار می\u200Cرود. این قلعه درسال ۱۹۲۰ میلادی (۱۲۹۹ هجری شمسی) توسط شخصی به نام «عیدوخان» ساخته شد و تا سال ۱۱۳۰۷ هجری شمسی به\u200Cعنوان محل سکونت همین شخص و خانواده\u200Cاش مورد بهره\u200Cبرداری قرار گرفت. بعدها از این قلعه به\u200Cعنوان محل نگهداری آذوقه و مهمات نیروهای انگلیسی به سرپرستی ژنرال دایر استفاده شده است.\n" +
                "\n" +
                "عمده مصالح به کار رفته در قلعه خشت خام و کاهگل است و دارای برج\u200Cها و طاق\u200Cهای هلالی زیبایی است که توسط سازمان میراث فرهنگی مورد مرمت و بازسازی قرار گرفته است.",
        image = R.drawable.heydar_abad_castle
    )

    val taftanMountains = Attraction(
        name = "رشته کوه تفتان",
        description = "این کوه در چهل و دو کیلومتری شمال شهر خاش بین شهر میرجاوه و شهرستان خاش واقع شده است. ارتفاع آن از سطح متوسط آب\u200Cهای خلیج فارس ۳۹۴۱ متر و نسبت به دشت\u200Cهای اطراف حدود دو هزار متر است.\n" +
                "\n" +
                "برخی بر این باورند که نام کوه تفتان از واژه تفت به معنی گرم و سوزان آمده است. این تسمیه به\u200Cعلت خروج آتشفشانی مرکب از بخار آب و گاز گوگرد از دهانه آن است. کوه تفتان در اصطلاح محلی به چهل تن معروف است. به\u200Cطوری که شایع است چهل تن از راشدین مذهبی در این کوه ناپدید شده\u200Cاند، ازاین\u200Cرو کوه چهل تن نامیده می\u200Cشود و شاخک شمال آن نیز به همین سبب به اسم کوه زیارت معروف شده و در گذشته محل زیارت اهالی این نواحی بوده است.",
        image = R.drawable.taftan_mountains
    )

    val irendganCastle = Attraction(
        name = "قلعه ایرندگان",
        description = "این بنا در روستای ایرندگان و در ۶۵ کیلومتری شهر خاش واقع شده است. روستای ایرندگان و روستاهای پیرامون آن در امتداد رودخانه شکل گرفته\u200Cاند و طول آن\u200Cها به ۵ کیلومتر می\u200Cرسد.\n" +
                "\n" +
                "زمان ساخت این قلعه به دوره قاجاریه باز می\u200Cگردد.",
        image = R.drawable.irendgan_castle
    )

    val threeSeeLake = Attraction(
        name = "دریاچه سه دریا",
        description = "این دریاچه که از جاذبه\u200Cهای طبیعی ناحیه بلوچستان است، در فاصله ۷۵ کیلومتری شهرستان خاش و در قلل کوه تفتان واقع شده است. همان طور که از نام آن مشخص است، از سه دریاچه کوچک تشکیل شده که عمق دو دریاچه در قسمت شمالی کم و اغلب آب گوارا دارند و دریاچه دیگر که نسبتا بزرگ\u200Cتر است، دارای آب دائمی و شور است.",
        image = R.drawable.three_see_lake
    )

    val ZarrinSanganCypress = Attraction(
        name = "سرو زربین سنگان",
        description = "سرو زربین سنگان درختی از گونه سرو با قدمت ۳۲۱۲ سال است که در استان سیستان و بلوچستان در ۴۵ کیلومتری شهر خاش واقع شده و ارتفاع آن حدود ۳۰ متر و قطر تنه آن ۳ متر است. این سرو به عنوان یکی از آثار طبیعی ملی ایران ثبت شده\u200Cاست. عمر این درخت را در حدود ۲۰۰۰ سال برآورد کرده\u200Cاند. \n" +
                "درختان سرو برای زرتشتیان مقدس بوده و بیشتر بدستِ موبدان کاشته می\u200Cشدند و به همین دلیل پس از اسلام، مردم منطقه برای اینکه این درخت را از بین نبرند از آن به نام درختِ میر عُمَر یاد می\u200Cکردند و بعدها به نام سُل نامگذاری شد. در گذشته مردم از این درخت به عنوانِ زیارتگاه و مکانی برای طلبیدنِ مراد و خواسته\u200Cهای خود استفاده می\u200Cکرده\u200Cاند. \n" +
                "\n",
        image = R.drawable.zarrin_sangan_cypress
    )
}